N, A, B = map(int, input().split())

# 各桁の総和を求める
# 例: N=4649 Ans=23
# 4649%10=9 → 4649/10=464 
# → 464%10=4 → 464/10=46
# 上記のように10で割ったあまりを足す計算を10で割った商ごとに初期値(4649)が0になるまで繰り返す
def calc_sum(n):
    sum = 0
    while N > 0:
        sum += N % 10
        N //= 10
    return sum

result = 0

# 与えられた範囲(A,B)の中に桁の総和があった場合、加算する
# 例: N:14, A:2, B:4
# 1~14 → 1,2,3,4,5,6,7,8,9,1,2,3,4,5(各数値の桁の和を求める) → 2,3,4,11(2),12(3),13(4) → 45
for i in range(1, N+1):
    if A <= calc_sum(i) <= B:
        result += i

print(result)